Revit 2024 API
ViewDisplayModel Class
 Represents the settings for displaying model graphics. version 2: m_showHiddenLines type changed bool -> ShowHiddenLinesValues::Enum
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class ViewDisplayModel : IDisposable
Visual Basic
Public Class ViewDisplayModel _
	Implements IDisposable
Visual C++
public ref class ViewDisplayModel : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewDisplayModel
See Also
ViewDisplayModel Members
Autodesk.Revit.DB Namespace